saved_model_schema_version: 1
meta_graphs {
  meta_info_def {
    stripped_op_list {
      op {
        name: "AddV2"
        input_arg {
          name: "x"
          type_attr: "T"
        }
        input_arg {
          name: "y"
          type_attr: "T"
        }
        output_arg {
          name: "z"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_BFLOAT16
              type: DT_HALF
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_UINT8
              type: DT_UINT16
              type: DT_UINT32
              type: DT_UINT64
              type: DT_INT8
              type: DT_INT16
              type: DT_INT32
              type: DT_INT64
              type: DT_COMPLEX64
              type: DT_COMPLEX128
            }
          }
        }
        is_aggregate: true
        is_commutative: true
      }
      op {
        name: "AssignVariableOp"
        input_arg {
          name: "resource"
          type: DT_RESOURCE
        }
        input_arg {
          name: "value"
          type_attr: "dtype"
        }
        attr {
          name: "dtype"
          type: "type"
        }
        is_stateful: true
      }
      op {
        name: "AvgPool"
        input_arg {
          name: "value"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "ksize"
          type: "list(int)"
          has_minimum: true
          minimum: 4
        }
        attr {
          name: "strides"
          type: "list(int)"
          has_minimum: true
          minimum: 4
        }
        attr {
          name: "padding"
          type: "string"
          allowed_values {
            list {
              s: "SAME"
              s: "VALID"
            }
          }
        }
        attr {
          name: "data_format"
          type: "string"
          default_value {
            s: "NHWC"
          }
          allowed_values {
            list {
              s: "NHWC"
              s: "NCHW"
            }
          }
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_HALF
              type: DT_BFLOAT16
              type: DT_FLOAT
              type: DT_DOUBLE
            }
          }
        }
      }
      op {
        name: "BiasAdd"
        input_arg {
          name: "value"
          type_attr: "T"
        }
        input_arg {
          name: "bias"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_INT32
              type: DT_UINT8
              type: DT_INT16
              type: DT_INT8
              type: DT_COMPLEX64
              type: DT_INT64
              type: DT_QINT8
              type: DT_QUINT8
              type: DT_QINT32
              type: DT_BFLOAT16
              type: DT_UINT16
              type: DT_COMPLEX128
              type: DT_HALF
              type: DT_UINT32
              type: DT_UINT64
            }
          }
        }
        attr {
          name: "data_format"
          type: "string"
          default_value {
            s: "NHWC"
          }
          allowed_values {
            list {
              s: "NHWC"
              s: "NCHW"
            }
          }
        }
      }
      op {
        name: "Const"
        output_arg {
          name: "output"
          type_attr: "dtype"
        }
        attr {
          name: "value"
          type: "tensor"
        }
        attr {
          name: "dtype"
          type: "type"
        }
      }
      op {
        name: "Conv2D"
        input_arg {
          name: "input"
          type_attr: "T"
        }
        input_arg {
          name: "filter"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_HALF
              type: DT_BFLOAT16
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_INT32
            }
          }
        }
        attr {
          name: "strides"
          type: "list(int)"
        }
        attr {
          name: "use_cudnn_on_gpu"
          type: "bool"
          default_value {
            b: true
          }
        }
        attr {
          name: "padding"
          type: "string"
          allowed_values {
            list {
              s: "SAME"
              s: "VALID"
              s: "EXPLICIT"
            }
          }
        }
        attr {
          name: "explicit_paddings"
          type: "list(int)"
          default_value {
            list {
            }
          }
        }
        attr {
          name: "data_format"
          type: "string"
          default_value {
            s: "NHWC"
          }
          allowed_values {
            list {
              s: "NHWC"
              s: "NCHW"
            }
          }
        }
        attr {
          name: "dilations"
          type: "list(int)"
          default_value {
            list {
              i: 1
              i: 1
              i: 1
              i: 1
            }
          }
        }
      }
      op {
        name: "DepthwiseConv2dNative"
        input_arg {
          name: "input"
          type_attr: "T"
        }
        input_arg {
          name: "filter"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_HALF
              type: DT_BFLOAT16
              type: DT_FLOAT
              type: DT_DOUBLE
            }
          }
        }
        attr {
          name: "strides"
          type: "list(int)"
        }
        attr {
          name: "padding"
          type: "string"
          allowed_values {
            list {
              s: "SAME"
              s: "VALID"
              s: "EXPLICIT"
            }
          }
        }
        attr {
          name: "explicit_paddings"
          type: "list(int)"
          default_value {
            list {
            }
          }
        }
        attr {
          name: "data_format"
          type: "string"
          default_value {
            s: "NHWC"
          }
          allowed_values {
            list {
              s: "NHWC"
              s: "NCHW"
            }
          }
        }
        attr {
          name: "dilations"
          type: "list(int)"
          default_value {
            list {
              i: 1
              i: 1
              i: 1
              i: 1
            }
          }
        }
      }
      op {
        name: "FusedBatchNormV3"
        input_arg {
          name: "x"
          type_attr: "T"
        }
        input_arg {
          name: "scale"
          type_attr: "U"
        }
        input_arg {
          name: "offset"
          type_attr: "U"
        }
        input_arg {
          name: "mean"
          type_attr: "U"
        }
        input_arg {
          name: "variance"
          type_attr: "U"
        }
        output_arg {
          name: "y"
          type_attr: "T"
        }
        output_arg {
          name: "batch_mean"
          type_attr: "U"
        }
        output_arg {
          name: "batch_variance"
          type_attr: "U"
        }
        output_arg {
          name: "reserve_space_1"
          type_attr: "U"
        }
        output_arg {
          name: "reserve_space_2"
          type_attr: "U"
        }
        output_arg {
          name: "reserve_space_3"
          type_attr: "U"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_HALF
              type: DT_BFLOAT16
              type: DT_FLOAT
            }
          }
        }
        attr {
          name: "U"
          type: "type"
          allowed_values {
            list {
              type: DT_FLOAT
            }
          }
        }
        attr {
          name: "epsilon"
          type: "float"
          default_value {
            f: 0.0001
          }
        }
        attr {
          name: "exponential_avg_factor"
          type: "float"
          default_value {
            f: 1.0
          }
        }
        attr {
          name: "data_format"
          type: "string"
          default_value {
            s: "NHWC"
          }
          allowed_values {
            list {
              s: "NHWC"
              s: "NCHW"
              s: "NDHWC"
              s: "NCDHW"
            }
          }
        }
        attr {
          name: "is_training"
          type: "bool"
          default_value {
            b: true
          }
        }
      }
      op {
        name: "Identity"
        input_arg {
          name: "input"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
        }
      }
      op {
        name: "Mean"
        input_arg {
          name: "input"
          type_attr: "T"
        }
        input_arg {
          name: "reduction_indices"
          type_attr: "Tidx"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "keep_dims"
          type: "bool"
          default_value {
            b: false
          }
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_INT32
              type: DT_UINT8
              type: DT_INT16
              type: DT_INT8
              type: DT_COMPLEX64
              type: DT_INT64
              type: DT_QINT8
              type: DT_QUINT8
              type: DT_QINT32
              type: DT_BFLOAT16
              type: DT_UINT16
              type: DT_COMPLEX128
              type: DT_HALF
              type: DT_UINT32
              type: DT_UINT64
            }
          }
        }
        attr {
          name: "Tidx"
          type: "type"
          default_value {
            type: DT_INT32
          }
          allowed_values {
            list {
              type: DT_INT32
              type: DT_INT64
            }
          }
        }
      }
      op {
        name: "MergeV2Checkpoints"
        input_arg {
          name: "checkpoint_prefixes"
          type: DT_STRING
        }
        input_arg {
          name: "destination_prefix"
          type: DT_STRING
        }
        attr {
          name: "delete_old_dirs"
          type: "bool"
          default_value {
            b: true
          }
        }
        is_stateful: true
      }
      op {
        name: "Mul"
        input_arg {
          name: "x"
          type_attr: "T"
        }
        input_arg {
          name: "y"
          type_attr: "T"
        }
        output_arg {
          name: "z"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_BFLOAT16
              type: DT_HALF
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_UINT8
              type: DT_INT8
              type: DT_UINT16
              type: DT_INT16
              type: DT_INT32
              type: DT_UINT32
              type: DT_UINT64
              type: DT_INT64
              type: DT_COMPLEX64
              type: DT_COMPLEX128
            }
          }
        }
        is_commutative: true
      }
      op {
        name: "NoOp"
      }
      op {
        name: "Pack"
        input_arg {
          name: "values"
          type_attr: "T"
          number_attr: "N"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "N"
          type: "int"
          has_minimum: true
          minimum: 1
        }
        attr {
          name: "T"
          type: "type"
        }
        attr {
          name: "axis"
          type: "int"
          default_value {
            i: 0
          }
        }
      }
      op {
        name: "Placeholder"
        output_arg {
          name: "output"
          type_attr: "dtype"
        }
        attr {
          name: "dtype"
          type: "type"
        }
        attr {
          name: "shape"
          type: "shape"
          default_value {
            shape {
              unknown_rank: true
            }
          }
        }
      }
      op {
        name: "ReadVariableOp"
        input_arg {
          name: "resource"
          type: DT_RESOURCE
        }
        output_arg {
          name: "value"
          type_attr: "dtype"
        }
        attr {
          name: "dtype"
          type: "type"
        }
        is_stateful: true
      }
      op {
        name: "Relu"
        input_arg {
          name: "features"
          type_attr: "T"
        }
        output_arg {
          name: "activations"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_INT32
              type: DT_UINT8
              type: DT_INT16
              type: DT_INT8
              type: DT_INT64
              type: DT_BFLOAT16
              type: DT_UINT16
              type: DT_HALF
              type: DT_UINT32
              type: DT_UINT64
              type: DT_QINT8
            }
          }
        }
      }
      op {
        name: "Relu6"
        input_arg {
          name: "features"
          type_attr: "T"
        }
        output_arg {
          name: "activations"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_INT32
              type: DT_UINT8
              type: DT_INT16
              type: DT_INT8
              type: DT_INT64
              type: DT_BFLOAT16
              type: DT_UINT16
              type: DT_HALF
              type: DT_UINT32
              type: DT_UINT64
            }
          }
        }
      }
      op {
        name: "Reshape"
        input_arg {
          name: "tensor"
          type_attr: "T"
        }
        input_arg {
          name: "shape"
          type_attr: "Tshape"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
        }
        attr {
          name: "Tshape"
          type: "type"
          default_value {
            type: DT_INT32
          }
          allowed_values {
            list {
              type: DT_INT32
              type: DT_INT64
            }
          }
        }
      }
      op {
        name: "RestoreV2"
        input_arg {
          name: "prefix"
          type: DT_STRING
        }
        input_arg {
          name: "tensor_names"
          type: DT_STRING
        }
        input_arg {
          name: "shape_and_slices"
          type: DT_STRING
        }
        output_arg {
          name: "tensors"
          type_list_attr: "dtypes"
        }
        attr {
          name: "dtypes"
          type: "list(type)"
          has_minimum: true
          minimum: 1
        }
        is_stateful: true
      }
      op {
        name: "SaveV2"
        input_arg {
          name: "prefix"
          type: DT_STRING
        }
        input_arg {
          name: "tensor_names"
          type: DT_STRING
        }
        input_arg {
          name: "shape_and_slices"
          type: DT_STRING
        }
        input_arg {
          name: "tensors"
          type_list_attr: "dtypes"
        }
        attr {
          name: "dtypes"
          type: "list(type)"
          has_minimum: true
          minimum: 1
        }
        is_stateful: true
      }
      op {
        name: "Select"
        input_arg {
          name: "condition"
          type: DT_BOOL
        }
        input_arg {
          name: "t"
          type_attr: "T"
        }
        input_arg {
          name: "e"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
        }
      }
      op {
        name: "Shape"
        input_arg {
          name: "input"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "out_type"
        }
        attr {
          name: "T"
          type: "type"
        }
        attr {
          name: "out_type"
          type: "type"
          default_value {
            type: DT_INT32
          }
          allowed_values {
            list {
              type: DT_INT32
              type: DT_INT64
            }
          }
        }
      }
      op {
        name: "ShardedFilename"
        input_arg {
          name: "basename"
          type: DT_STRING
        }
        input_arg {
          name: "shard"
          type: DT_INT32
        }
        input_arg {
          name: "num_shards"
          type: DT_INT32
        }
        output_arg {
          name: "filename"
          type: DT_STRING
        }
      }
      op {
        name: "Softmax"
        input_arg {
          name: "logits"
          type_attr: "T"
        }
        output_arg {
          name: "softmax"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_HALF
              type: DT_BFLOAT16
              type: DT_FLOAT
              type: DT_DOUBLE
            }
          }
        }
      }
      op {
        name: "Squeeze"
        input_arg {
          name: "input"
          type_attr: "T"
        }
        output_arg {
          name: "output"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
        }
        attr {
          name: "squeeze_dims"
          type: "list(int)"
          default_value {
            list {
            }
          }
          has_minimum: true
        }
      }
      op {
        name: "StatefulPartitionedCall"
        input_arg {
          name: "args"
          type_list_attr: "Tin"
        }
        output_arg {
          name: "output"
          type_list_attr: "Tout"
        }
        attr {
          name: "Tin"
          type: "list(type)"
          has_minimum: true
        }
        attr {
          name: "Tout"
          type: "list(type)"
          has_minimum: true
        }
        attr {
          name: "f"
          type: "func"
        }
        attr {
          name: "config"
          type: "string"
          default_value {
            s: ""
          }
        }
        attr {
          name: "config_proto"
          type: "string"
          default_value {
            s: ""
          }
        }
        attr {
          name: "executor_type"
          type: "string"
          default_value {
            s: ""
          }
        }
        is_stateful: true
      }
      op {
        name: "StaticRegexFullMatch"
        input_arg {
          name: "input"
          type: DT_STRING
        }
        output_arg {
          name: "output"
          type: DT_BOOL
        }
        attr {
          name: "pattern"
          type: "string"
        }
      }
      op {
        name: "StringJoin"
        input_arg {
          name: "inputs"
          type: DT_STRING
          number_attr: "N"
        }
        output_arg {
          name: "output"
          type: DT_STRING
        }
        attr {
          name: "N"
          type: "int"
          has_minimum: true
          minimum: 1
        }
        attr {
          name: "separator"
          type: "string"
          default_value {
            s: ""
          }
        }
      }
      op {
        name: "Sub"
        input_arg {
          name: "x"
          type_attr: "T"
        }
        input_arg {
          name: "y"
          type_attr: "T"
        }
        output_arg {
          name: "z"
          type_attr: "T"
        }
        attr {
          name: "T"
          type: "type"
          allowed_values {
            list {
              type: DT_BFLOAT16
              type: DT_HALF
              type: DT_FLOAT
              type: DT_DOUBLE
              type: DT_UINT8
              type: DT_INT8
              type: DT_UINT16
              type: DT_INT16
              type: DT_INT32
              type: DT_INT64
              type: DT_COMPLEX64
              type: DT_COMPLEX128
              type: DT_UINT32
              type: DT_UINT64
            }
          }
        }
      }
      op {
        name: "VarHandleOp"
        output_arg {
          name: "resource"
          type: DT_RESOURCE
        }
        attr {
          name: "container"
          type: "string"
          default_value {
            s: ""
          }
        }
        attr {
          name: "shared_name"
          type: "string"
          default_value {
            s: ""
          }
        }
        attr {
          name: "dtype"
          type: "type"
        }
        attr {
          name: "shape"
          type: "shape"
        }
        attr {
          name: "allowed_devices"
          type: "list(string)"
          default_value {
            list {
            }
          }
        }
        is_stateful: true
      }
    }
    tags: "serve"
    tensorflow_version: "2.5.0"
    tensorflow_git_version: "unknown"
    stripped_default_attrs: true
  }
  graph_def {
    node {
      name: "save_counter"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
      attr {
        key: "shape"
        value {
          shape {
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "save_counter"
        }
      }
    }
    node {
      name: "save_counter/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "save_counter"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_INT64
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/expand/BatchNorm/gamma"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 96
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_3/expand/BatchNorm/gamma"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/expand/BatchNorm/gamma/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_3/expand/BatchNorm/gamma"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 96
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/depthwise/depthwise_weights"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 5
            }
            dim {
              size: 5
            }
            dim {
              size: 96
            }
            dim {
              size: 1
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_3/depthwise/depthwise_weights"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/depthwise/depthwise_weights/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_3/depthwise/depthwise_weights"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 5
              }
              dim {
                size: 5
              }
              dim {
                size: 96
              }
              dim {
                size: 1
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/gamma"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 96
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/gamma"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/gamma/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_3/depthwise/BatchNorm/gamma"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 96
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_4/expand/BatchNorm/moving_variance"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 240
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_4/expand/BatchNorm/moving_variance"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_4/expand/BatchNorm/moving_variance/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_4/expand/BatchNorm/moving_variance"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 240
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_7/depthwise/depthwise_weights"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 5
            }
            dim {
              size: 5
            }
            dim {
              size: 144
            }
            dim {
              size: 1
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_7/depthwise/depthwise_weights"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_7/depthwise/depthwise_weights/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_7/depthwise/depthwise_weights"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 5
              }
              dim {
                size: 5
              }
              dim {
                size: 144
              }
              dim {
                size: 1
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_7/project/BatchNorm/moving_variance"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 48
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_7/project/BatchNorm/moving_variance"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_7/project/BatchNorm/moving_variance/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_7/project/BatchNorm/moving_variance"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 48
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/gamma"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 576
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/gamma"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/gamma/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_10/depthwise/BatchNorm/gamma"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 576
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/biases"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 576
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/biases"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/biases/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_10/squeeze_excite/Conv_1/biases"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 576
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_1/expand/BatchNorm/beta"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 72
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_1/expand/BatchNorm/beta"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_1/expand/BatchNorm/beta/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_1/expand/BatchNorm/beta"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 72
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_2/project/BatchNorm/beta"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 24
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_2/project/BatchNorm/beta"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_2/project/BatchNorm/beta/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_2/project/BatchNorm/beta"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 24
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_4/project/weights"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 1
            }
            dim {
              size: 1
            }
            dim {
              size: 240
            }
            dim {
              size: 40
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_4/project/weights"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_4/project/weights/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_4/project/weights"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 1
              }
              dim {
                size: 1
              }
              dim {
                size: 240
              }
              dim {
                size: 40
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/biases"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 64
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/biases"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/biases/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_4/squeeze_excite/Conv/biases"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 64
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_9/expand/BatchNorm/moving_mean"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 576
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_9/expand/BatchNorm/moving_mean"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_9/expand/BatchNorm/moving_mean/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_9/expand/BatchNorm/moving_mean"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 576
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_10/project/weights"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 1
            }
            dim {
              size: 1
            }
            dim {
              size: 576
            }
            dim {
              size: 96
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_10/project/weights"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_10/project/weights/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_10/project/weights"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 1
              }
              dim {
                size: 1
              }
              dim {
                size: 576
              }
              dim {
                size: 96
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/Conv/BatchNorm/beta"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 16
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/Conv/BatchNorm/beta"
        }
      }
    }
    node {
      name: "MobilenetV3/Conv/BatchNorm/beta/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/Conv/BatchNorm/beta"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 16
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv/depthwise/BatchNorm/moving_mean"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 16
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv/depthwise/BatchNorm/moving_mean"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv/depthwise/BatchNorm/moving_mean/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv/depthwise/BatchNorm/moving_mean"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 16
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_1/expand/BatchNorm/gamma"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 72
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_1/expand/BatchNorm/gamma"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_1/expand/BatchNorm/gamma/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_1/expand/BatchNorm/gamma"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 72
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_1/project/BatchNorm/gamma"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 24
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_1/project/BatchNorm/gamma"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_1/project/BatchNorm/gamma/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_1/project/BatchNorm/gamma"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 24
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/biases"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 24
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/biases"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/biases/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_3/squeeze_excite/Conv/biases"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 24
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/weights"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 1
            }
            dim {
              size: 1
            }
            dim {
              size: 240
            }
            dim {
              size: 64
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/weights"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/weights/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv/weights"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 1
              }
              dim {
                size: 1
              }
              dim {
                size: 240
              }
              dim {
                size: 64
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/biases"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 240
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/biases"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/biases/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_5/squeeze_excite/Conv_1/biases"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 240
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_8/project/BatchNorm/beta"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
          shape {
            dim {
              size: 96
            }
          }
        }
      }
      attr {
        key: "shared_name"
        value {
          s: "MobilenetV3/expanded_conv_8/project/BatchNorm/beta"
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_8/project/BatchNorm/beta/Read/ReadVariableOp"
      op: "ReadVariableOp"
      input: "MobilenetV3/expanded_conv_8/project/BatchNorm/beta"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
              dim {
                size: 96
              }
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
    }
    node {
      name: "MobilenetV3/expanded_conv_9/squeeze_excite/Conv/weights"
      op: "VarHandleOp"
      attr {
        key: "_output_shapes"
        value {
          list {
            shape {
            }
          }
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "shape"
        value {
